NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A010F1536IM48.svd
        <register>
          <name>CDBUSALLOC</name>
          <description>CD Bus allocation</description>
          <addressOffset>0x328</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0F0F0F0F</resetMask>
          <fields>
            <field>
              <name>CDEVEN0</name>
              <description>CD Bus Even 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP0</name>
                  <description>The bus is allocated to ACMP0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1</name>
                  <description>The bus is allocated to ACMP1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC0CH0</name>
                  <description>The bus is allocated to VDAC0 CH0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC1CH0</name>
                  <description>The bus is allocated to VDAC1 CH0</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEFUSE</name>
                  <description>The bus is allocated to Repair EFUSE programming voltage</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMON</name>
                  <description>The bus is allocated to Process Monitor</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EFUSE</name>
                  <description>The bus is allocated for EFUSE programming voltage</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDEVEN1</name>
              <description>CD Bus Even 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP0</name>
                  <description>The bus is allocated to ACMP0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1</name>
                  <description>The bus is allocated to ACMP1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC0CH1</name>
                  <description>The bus is allocated to VDAC0 CH1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC1CH1</name>
                  <description>The bus is allocated to VDAC1 CH1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDODD0</name>
              <description>CD Bus Odd 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP0</name>
                  <description>The bus is allocated to ACMP0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1</name>
                  <description>The bus is allocated to ACMP1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC0CH0</name>
                  <description>The bus is allocated to VDAC0 CH0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC1CH0</name>
                  <description>The bus is allocated to VDAC1 CH0</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMON</name>
                  <description>The bus is allocated to Process Monitor</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDODD1</name>
              <description>CD Bus Odd 1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRISTATE</name>
                  <description>The bus is not allocated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>The bus is allocated to ADC0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP0</name>
                  <description>The bus is allocated to ACMP0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP1</name>
                  <description>The bus is allocated to ACMP1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC0CH1</name>
                  <description>The bus is allocated to VDAC0 CH1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC1CH1</name>
                  <description>The bus is allocated to VDAC1 CH1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG</name>
                  <description>DEBUG mode, bus allocated to all clients</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIPSELL</name>
          <description>External Interrupt Port Select Low</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x33333333</resetMask>
          <fields>
            <field>
              <name>EXTIPSEL0</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL1</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL2</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL3</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL4</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL5</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL6</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL7</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIPSELH</name>
          <description>External interrupt Port Select High</description>
          <addressOffset>0x404</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003333</resetMask>
          <fields>
            <field>
              <name>EXTIPSEL0</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL1</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL2</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTIPSEL3</name>
              <description>External Interrupt Port Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A group selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B group selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C group selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D group selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
