NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A010F1536IM48.svd
        <register>
          <name>FENOTCHATT7</name>
          <description>No Description</description>
          <addressOffset>0x11C</addressOffset>
          <access>read-write</access>
          <resetValue>0x20080000</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>FENOTCHATTNSEL15</name>
              <description>FE Notch attn sel code for index 15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE15</name>
              <description>FE Notch coarse cap code for index 15</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE15</name>
              <description>FE Notch fine cap code for index 15</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN15</name>
              <description>FE notch rattn enable for index 15</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN15</name>
              <description>FE notch enable for index 15</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHATTNSEL16</name>
              <description>FE Notch attn sel code for index 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE16</name>
              <description>FE Notch coarse cap code for index 16</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE16</name>
              <description>FE Notch fine cap code for index 16</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN16</name>
              <description>FE notch rattn enable for index 16</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN16</name>
              <description>FE notch enable for index 16</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FENOTCHATT8</name>
          <description>No Description</description>
          <addressOffset>0x120</addressOffset>
          <access>read-write</access>
          <resetValue>0x200B200A</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>FENOTCHATTNSEL17</name>
              <description>FE Notch attn sel code for index 17</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE17</name>
              <description>FE Notch coarse cap code for index 17</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE17</name>
              <description>FE Notch fine cap code for index 17</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN17</name>
              <description>FE notch rattn enable for index 17</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN17</name>
              <description>FE notch enable for index 17</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHATTNSEL18</name>
              <description>FE Notch attn sel code for index 18</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE18</name>
              <description>FE Notch coarse cap code for index 18</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE18</name>
              <description>FE Notch fine cap code for index 18</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN18</name>
              <description>FE notch rattn enable for index 18</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN18</name>
              <description>FE notch enable for index 18</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FENOTCHATT9</name>
          <description>No Description</description>
          <addressOffset>0x124</addressOffset>
          <access>read-write</access>
          <resetValue>0x200B200B</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>FENOTCHATTNSEL19</name>
              <description>FE Notch attn sel code for index 19</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE19</name>
              <description>FE Notch coarse cap code for index 19</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE19</name>
              <description>FE Notch fine cap code for index 19</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN19</name>
              <description>FE notch rattn enable for index 19</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN19</name>
              <description>FE notch enable for index 19</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHATTNSEL20</name>
              <description>FE Notch attn sel code for index 20</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE20</name>
              <description>FE Notch coarse cap code for index 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE20</name>
              <description>FE Notch fine cap code for index 20</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN20</name>
              <description>FE notch rattn enable for index 20</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN20</name>
              <description>FE notch enable for index 20</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FENOTCHATT10</name>
          <description>No Description</description>
          <addressOffset>0x128</addressOffset>
          <access>read-write</access>
          <resetValue>0x200B200B</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>FENOTCHATTNSEL21</name>
              <description>FE Notch attn sel code for index 21</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE21</name>
              <description>FE Notch coarse cap code for index 21</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE21</name>
              <description>FE Notch fine cap code for index 21</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN21</name>
              <description>FE notch rattn enable for index 21</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN21</name>
              <description>FE notch enable for index 21</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHATTNSEL22</name>
              <description>FE Notch attn sel code for index 22</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE22</name>
              <description>FE Notch coarse cap code for index 22</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE22</name>
              <description>FE Notch fine cap code for index 22</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN22</name>
              <description>FE notch rattn enable for index 22</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN22</name>
              <description>FE notch enable for index 22</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FENOTCHATT11</name>
          <description>No Description</description>
          <addressOffset>0x12C</addressOffset>
          <access>read-write</access>
          <resetValue>0x200B200B</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>FENOTCHATTNSEL23</name>
              <description>FE Notch attn sel code for index 23</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE23</name>
              <description>FE Notch coarse cap code for index 23</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE23</name>
              <description>FE Notch fine cap code for index 23</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN23</name>
              <description>FE notch rattn enable for index 23</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN23</name>
              <description>FE notch enable for index 23</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHATTNSEL24</name>
              <description>FE Notch attn sel code for index 24</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE24</name>
              <description>FE Notch coarse cap code for index 24</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE24</name>
              <description>FE Notch fine cap code for index 24</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN24</name>
              <description>FE notch rattn enable for index 24</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN24</name>
              <description>FE notch enable for index 24</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FENOTCHFILT0</name>
          <description>No Description</description>
          <addressOffset>0x130</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>FENOTCHATTNSEL1</name>
              <description>FE Notch attn sel code for index 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE1</name>
              <description>FE Notch coarse cap code for index 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE1</name>
              <description>FE Notch fine cap code for index 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN1</name>
              <description>FE notch rattn enable for index 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN1</name>
              <description>FE notch enable for index 1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHATTNSEL2</name>
              <description>FE Notch attn sel code for index 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE2</name>
              <description>FE Notch coarse cap code for index 2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE2</name>
              <description>FE Notch fine cap code for index 2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN2</name>
              <description>FE notch rattn enable for index 2</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN2</name>
              <description>FE notch enable for index 2</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FENOTCHFILT1</name>
          <description>No Description</description>
          <addressOffset>0x134</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>FENOTCHATTNSEL3</name>
              <description>FE Notch attn sel code for index 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE3</name>
              <description>FE Notch coarse cap code for index 3</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE3</name>
              <description>FE Notch fine cap code for index 3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN3</name>
              <description>FE notch rattn enable for index 3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN3</name>
              <description>FE notch enable for index 3</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHATTNSEL4</name>
              <description>FE Notch attn sel code for index 4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE4</name>
              <description>FE Notch coarse cap code for index 4</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE4</name>
              <description>FE Notch fine cap code for index 4</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN4</name>
              <description>FE notch rattn enable for index 4</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN4</name>
              <description>FE notch enable for index 4</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
