NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A010F1536IM48.svd
        <register>
          <name>CTRL5</name>
          <description>No Description</description>
          <addressOffset>0x060</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x6F7FFFFE</resetMask>
          <fields>
            <field>
              <name>BRCALEN</name>
              <description>Baudrate calibration enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRCALMODE</name>
              <description>Baudrate calibration mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PEAK</name>
                  <description>Measure period between peaks in demodulated signal. This mode can give false peaks for high oversampling ratios without sufficient datafiltering.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZERO</name>
                  <description>Measure period between zero-crossings in demodulated signal. This mode can miss zero-crossings for high frequency offsets.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEAKZERO</name>
                  <description>Combine peak-period and zero-crossing periods. This mode gives best accuracy, but includes weaknesses from both PEAK and ZERO modes.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRCALAVG</name>
              <description>Baudrate calibration averaging</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DETDEL</name>
              <description>Detection delay</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TDEDGE</name>
              <description>Timing detection edge mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TREDGE</name>
              <description>Timing resynchronization edge mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSSSCTD</name>
              <description>DSSS Correlation Threshold Disable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBSS</name>
              <description>Baseband Signal Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POEPER</name>
              <description>Phase Offset Estimation Period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEMODRAWDATASEL2</name>
              <description>Demod raw data select 2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COH</name>
                  <description>Coherent demod 5-bit I and Q input data, 10-bit I and Q data after FOE/POE.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORR</name>
                  <description>4-bit max_corr_index and 17-bit max_corr .</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHPW</name>
                  <description>8-bit channel power and 4-bit BBSSMUX</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BBPF</name>
                  <description>11-bit pre-filter correlation output for BLR and 11-bit pre-filter correlation output for COH demod</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSM</name>
                  <description>5-bit Narrow-band BLE FSM state, 5-bit Long-range BLE FSM state, 3-bit DSA FSM state, 7-bit Detection FSM State. Captured each time state changes</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HADM</name>
                  <description>Packed 32-bit words containing the results of HADM SQTE steps</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FOEPREAVG</name>
              <description>Frequency Offset Estimate Pre-Averaging</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LINCORR</name>
              <description>Linear Correlation</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESYNCBAUDTRANS</name>
              <description>Resynchronization Baud Transitions</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESYNCLIMIT</name>
              <description>Resynchronization Limit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HALF</name>
                  <description>Adjust timing if accumulated timing is higher/lower than RESYNCPER/2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Adjust timing if accumulated timing is non-zero.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL6</name>
          <description>No Description</description>
          <addressOffset>0x064</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TDREW</name>
              <description>Timing Detection Rewind</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREBASES</name>
              <description>Preamble Bases</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSTIMABORT0</name>
              <description>Preamble Search Timing Abort Criteria 0</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSTIMABORT1</name>
              <description>Preamble Search Timing Abort Criteria 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSTIMABORT2</name>
              <description>Preamble Search Timing Abort Criteria 2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSTIMABORT3</name>
              <description>Preamble Search Timing Abort Criteria 3</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARW</name>
              <description>Allow Received Window</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMALLWND</name>
                  <description>Allow received windows when window size is less than half the RAM size.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always allow received windows.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEVER</name>
                  <description>Never allow received windows.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSABORT</name>
                  <description>Allow received windows right after PSTIMABORTn tests have aborted timing and coherent detection is enabled, or when window size is less than half the RAM size.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMTHRESHGAIN</name>
              <description>Timing Threshold Gain</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPLXCORREN</name>
              <description>Enable Complex Correlation</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSSS3SYMBOLSYNCEN</name>
              <description>Enable three symbol sync detection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDBPSKINV</name>
              <description>TX DBPSK modulation encode invert</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDBPSKRAMPEN</name>
              <description>TX DBPSK PA Ramp Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IFADCDIGGAINCLKSEL</name>
              <description>IFADC Output Dig Gain Clock Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CODINGB</name>
              <description>Coding format</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NRZ</name>
                  <description>Non Return to Zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MANCHESTER</name>
                  <description>Manchester Coding</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSSS</name>
                  <description>Direct Sequence Spread Spectrum</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINECODE</name>
                  <description>Line code. Maps 0 to 0011 symbol and 1 to 1100 symbols</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFADCDIGGAIN</name>
              <description>IFADC Output Dig Gain Select</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBRCALCDIS</name>
              <description>RX Baudrate Calculation Disable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBR</name>
          <description>No Description</description>
          <addressOffset>0x068</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>TXBRNUM</name>
              <description>Transmit baudrate numerator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBRDEN</name>
              <description>Transmit baudrate denominator</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXBR</name>
          <description>No Description</description>
          <addressOffset>0x06C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <fields>
            <field>
              <name>RXBRNUM</name>
              <description>Receive baudrate numerator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBRDEN</name>
              <description>Receive baudrate denominator</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBRINT</name>
              <description>Receive baudrate integer</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CF</name>
          <description>No Description</description>
          <addressOffset>0x070</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xCFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEC0</name>
              <description>First decimation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DF3</name>
                  <description>Decimation Factor 0 = 3. Cutoff 0.050 * f&lt;subscript&gt;HFXO&lt;/subscript&gt;.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DF4WIDE</name>
                  <description>Decimation Factor 0 = 4. Cutoff 0.069 * f&lt;subscript&gt;HFXO&lt;/subscript&gt;.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DF4NARROW</name>
                  <description>Decimation Factor 0 = 4. Cutoff 0.037 * f&lt;subscript&gt;HFXO&lt;/subscript&gt;.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DF8WIDE</name>
                  <description>Decimation Factor 0 = 8. Cutoff 0.012 * f&lt;subscript&gt;HFXO&lt;/subscript&gt;.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DF8NARROW</name>
                  <description>Decimation Factor 0 = 8. Cutoff 0.005 * f&lt;subscript&gt;HFXO&lt;/subscript&gt;.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEC1</name>
              <description>Second decimation</description>
              <bitOffset>3</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEC2</name>
              <description>Third decimation</description>
              <bitOffset>17</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CFOSR</name>
              <description>Center Frequency Oversampling Ratio</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CF7</name>
                  <description>Oversampling ratio = 7</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CF8</name>
                  <description>Oversampling ratio = 8</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CF12</name>
                  <description>Oversampling ratio = 12</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CF16</name>
                  <description>Oversampling ratio = 16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CF32</name>
                  <description>Oversampling ratio = 32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CF0</name>
                  <description>Center frequency set to 0</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEC1GAIN</name>
              <description>Second decimation filter gain</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADD0</name>
                  <description>No additional gain. Suggested setting for BW higher than 1kHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD6</name>
                  <description>6 dB additional gain. Suggested setting for BW between 250 Hz and 1 kHz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD12</name>
                  <description>12 dB additional gain. Suggested setting for BW less than 250 Hz</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
